// Дано число из отрезка [10, 99]. Показать наибольшую цифру числа.

int namber = new Random().Next(10,99);
Console.WriteLine(namber);